<a href="https://colab.research.google.com/github/Luganda1/Google-colab-/blob/main/College_Degree_salary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
60 * 2

120

In [ ]:
    import pandas as pd

    df = pd.read_csv('salary.csv')

In [ ]:
df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [ ]:
df.shape

(51, 6)

In [ ]:
df.columns

Index(['Undergraduate Major', ' Starting Median Salary ',
       ' Mid-Career Median Salary ', ' Mid-Career 10th Percentile Salary ',
       ' Mid-Career 90th Percentile Salary ', 'Group'],
      dtype='object')

In [ ]:
df.isna()

In [ ]:
df.tail()

      Undergraduate Major  ...  Group
46             Psychology  ...   HASS
47               Religion  ...   HASS
48              Sociology  ...   HASS
49                Spanish  ...   HASS
50  Source: PayScale Inc.  ...    NaN

[5 rows x 6 columns]

In [ ]:
clean_df = df.dropna()
clean_df.tail()

   Undergraduate Major  ...  Group
45   Political Science  ...   HASS
46          Psychology  ...   HASS
47            Religion  ...   HASS
48           Sociology  ...   HASS
49             Spanish  ...   HASS

[5 rows x 6 columns]

In [ ]:
clean_df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [ ]:
clean_df[' Starting Median Salary '].max()

74300.0

In [ ]:
clean_df[' Starting Median Salary '].astype(float).idxmax()

43

In [ ]:
clean_df[' Starting Median Salary '].loc[43]

74300.0

In [ ]:
clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [ ]:
clean_df.loc[43]

Undergraduate Major                    Physician Assistant
 Starting Median Salary                              74300
 Mid-Career Median Salary                            91700
 Mid-Career 10th Percentile Salary                   66400
 Mid-Career 90th Percentile Salary                  124000
Group                                                 STEM
Name: 43, dtype: object

In [ ]:
clean_df[' Mid-Career 10th Percentile Salary '].max()

71900.0

In [ ]:
clean_df[' Mid-Career 10th Percentile Salary '].idxmax()

8

In [ ]:
clean_df.loc[8]

Undergraduate Major                    Chemical Engineering
 Starting Median Salary                               63200
 Mid-Career Median Salary                            107000
 Mid-Career 10th Percentile Salary                    71900
 Mid-Career 90th Percentile Salary                   194000
Group                                                  STEM
Name: 8, dtype: object

Chemical Engineering Mid-career is defined as having 10+ years of experience earn 71900

In [ ]:
clean_df[' Starting Median Salary '].idxmin()

49

In [ ]:
clean_df.loc[49]

Undergraduate Major                    Spanish
 Starting Median Salary                  34000
 Mid-Career Median Salary                53100
 Mid-Career 10th Percentile Salary       31000
 Mid-Career 90th Percentile Salary       96400
Group                                     HASS
Name: 49, dtype: object

In [ ]:
clean_df[' Mid-Career Median Salary '].idxmin()

18

In [ ]:
clean_df.loc[18]

Undergraduate Major                    Education
 Starting Median Salary                    34900
 Mid-Career Median Salary                  52000
 Mid-Career 10th Percentile Salary         29300
 Mid-Career 90th Percentile Salary        102000
Group                                       HASS
Name: 18, dtype: object

In [ ]:
new_col = clean_df[' Mid-Career 90th Percentile Salary '] - clean_df[' Mid-Career 10th Percentile Salary ']
clean_df.insert(1, 'Risk Level', new_col)
clean_df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 7 columns]

In [ ]:
low_risk = clean_df.sort_values('Risk Level')

In [ ]:
low_risk[['Undergraduate Major', 'Risk Level']].head()

           Undergraduate Major  Risk Level
40                     Nursing     50700.0
43         Physician Assistant     57600.0
41                   Nutrition     65300.0
49                     Spanish     65400.0
27  Health Care Administration     66400.0

In [ ]:
highest_earners = clean_df.sort_values(' Mid-Career 90th Percentile Salary ', ascending=False)

In [ ]:
highest_earners[['Undergraduate Major', ' Mid-Career 90th Percentile Salary ']].head()

     Undergraduate Major   Mid-Career 90th Percentile Salary
17             Economics                             210000.0
22               Finance                             195000.0
8   Chemical Engineering                             194000.0
37                  Math                             183000.0
44               Physics                             178000.0

In [ ]:
greatest_risk = clean_df.sort_values('Risk Level', ascending=False)

In [ ]:
greatest_risk[['Undergraduate Major', 'Risk Level']].head()

   Undergraduate Major  Risk Level
17           Economics    159400.0
22             Finance    147800.0
37                Math    137800.0
36           Marketing    132900.0
42          Philosophy    132500.0

In [ ]:
clean_df.groupby('Group').count()

          Undergraduate Major  ...   Mid-Career 90th Percentile Salary
Group                          ...
Business                   12  ...                                   12
HASS                       22  ...                                   22
STEM                       16  ...                                   16

[3 rows x 6 columns]

In [ ]:
pd.options.display.float_format = '{:,.2f}'.format

In [ ]:
clean_df.groupby('Group').mean()

          Risk Level  ...   Mid-Career 90th Percentile Salary
Group                 ...
Business  103,958.33  ...                           147,525.00
HASS       95,218.18  ...                           129,363.64
STEM      101,600.00  ...                           157,625.00

[3 rows x 5 columns]